backend/controllers/CategoryController.php

    public function actionCreate($id = null)
    {
        $categories = Category::find()->all();
        $model = new Category();
        $model->parent_id = $id;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `category`
INSERT INTO `category` (`parent_id`, `title`, `slug`) VALUES (NULL, 'Meja Kursi', 'meja-kursi')

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `category` WHERE `id`='1'