backend/controllers/ProductController.php

    public function actionCreate()
    {
        $categories = Category::find()->all();
        $model = new Product();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `category`
INSERT INTO `product` (`title`, `description`, `category_id`, `price`, `slug`) VALUES ('1 set Meja Kursi', '1 set meja kursi antik', 2, '34000.00', '1-set-meja-kursi')

    public function actionUpdate($id)
    {
        $categories = Category::find()->all();
---
SELECT * FROM `category`

    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {
---
SELECT * FROM `product` WHERE `id`='1'